Enums/ЦветаМетокЯндексКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЦветаМетокЯндексКарты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Голубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Красный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемноОранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемноСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемноГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коричневый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемноЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Желтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СветлоГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оливковый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЦветаМетокЯндексКарты/Ext/ManagerModule.bsl
Функция ПолучитьПредставлениеЦветаМеткиЯндекс(Метка) Экспорт
	
	Результат = "black";
	Если Метка = Перечисления.ЦветаМетокЯндексКарты.Голубой Тогда
		Результат = "blue";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Желтый Тогда
		Результат = "yellow";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Зеленый Тогда
		Результат = "green";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Коричневый Тогда
		Результат = "brown";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Красный Тогда
		Результат = "red";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Оливковый Тогда
		Результат = "olive";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Оранжевый Тогда
		Результат = "orange";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Розовый Тогда
		Результат = "pink";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.СветлоГолубой Тогда
		Результат = "lightBlue";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Серый Тогда
		Результат = "gray";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноГолубой Тогда
		Результат = "darkBlue";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноЗеленый Тогда
		Результат = "darkGreen";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноОранжевый Тогда
		Результат = "darkOrange";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноСиний Тогда
		Результат = "night";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Фиолетовый Тогда
		Результат = "violet";
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Черный Тогда
		Результат = "black";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЦвет1сМеткиЯндекс(Метка) Экспорт
	
	Результат = "#000000"; //Новый Цвет(0, 0, 0);
	Если Метка = Перечисления.ЦветаМетокЯндексКарты.Голубой Тогда
		Результат = "#1E98FF"; //Новый Цвет(30, 152, 255);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Желтый Тогда
		Результат = "#FFD21E"; //Новый Цвет(255, 210, 30);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Зеленый Тогда
		Результат = "#56db40"; //Новый Цвет(86, 219, 64);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Коричневый Тогда
		Результат = "#793d0e"; //Новый Цвет(121, 61, 14);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Красный Тогда
		Результат = "#ED4543"; //Новый Цвет(237, 69, 67);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Оливковый Тогда
		Результат = "#97a100"; //Новый Цвет(151, 161, 0);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Оранжевый Тогда
		Результат = "#ff931e"; //Новый Цвет(255, 147, 30);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Розовый Тогда
		Результат = "#f371d1"; //Новый Цвет(243, 113, 209);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.СветлоГолубой Тогда
		Результат = "#82cdff"; //Новый Цвет(130, 205, 255);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Серый Тогда
		Результат = "#b3b3b3"; //Новый Цвет(179, 179, 179);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноГолубой Тогда
		Результат = "#177bc9"; //Новый Цвет(23, 123, 201);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноЗеленый Тогда
		Результат = "#1bad03"; //Новый Цвет(27, 173, 3);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноОранжевый Тогда
		Результат = "#e6761b"; //Новый Цвет(230, 118, 27);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.ТемноСиний Тогда
		Результат = "#0e4779"; //Новый Цвет(14, 71, 121);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Фиолетовый Тогда
		Результат = "#b51eff"; //Новый Цвет(181, 30, 255);
	ИначеЕсли Метка = Перечисления.ЦветаМетокЯндексКарты.Черный Тогда
		Результат = "#595959"; //Новый Цвет(89, 89, 89);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
